[
  {
    "company": "Anax Real Estate",
    "company_location": "Remote, New York, USA",
    "role": "Founding Engineer",
    "time_duration": "April 2025 - Present",
    "stack": "Stack:- Python, Docker, Next.js, PostgreSQL",
    "details": [
      {
        "title": "Build Up the Product",
        "descriptions": [
          "Reorganized the reachout funnel that lead the engagement rates to 10x through niched AI powered outreach with filterd Deals.",
          "Backtested the AI pipelines to use the best models and prompt engineering to get the best results in lower cost started from openai moved to gemini and finalized the groq models.",
          "Added Agentic Support in the entire reachout funnel to make it more efficient and less human intervention over the lifecycle of the product.",
          "Redesined the context engineering approach to the data enrichment pipeline to make it more qualitative to use down funneling the leads to reachout.",
          "Created a Article Enrichment Pipeline which reduced the cost of third party data aquisition and added auto ingestion to the new leads, deals in the product from Real World Data."
        ],
        "languages": "Stack:- Python, Docker, Next.js, PostgreSQL, Agentic AI",
        "scale": "Enabling the Real Estate Industry to be more efficient With AI Powered Lead Generation and Reachout"
      }
    ]
  },
  {
    "company": "MEDIA.NET (Directi)",
    "company_location": "Remote, India",
    "role": "Data Application Developer 2",
    "time_duration": "October 2021 - April 2025",
    "stack": "Stack:- Scala, Java, SQL, Spark, Kafka, PySpark, Hdfs",
    "details": [
      {
        "title": "DANTE (Data Anomaly Tracker)",
        "descriptions": [
          "Conceptualized our first configurable data quality tools which fortified data integrity for pipelines.",
          "Optimized parallel data reading, leading to a 60-pct reduction in data (>100GB) processing time, enabling developers to perform real-time data validation and trend analysis for voluminous datasets.",
          "EQ Tracer: A tool to monitor summative metric trends across configurable hierarchies with dynamic alerting mechanisms to filter out noise data, ensuring accurate insights.",
          "Ratio Tracer: A tool for outlier detection using customizable percentile thresholds, enabling the proactive identification and mitigation of anomalies.",
          "PM Tracer: A logging and monitoring tool that aggregates data from multiple sources, providing detailed coverage and mismatch analysis for enhanced data quality and system reliability."

        ],
        "languages": "Stack:- Scala, Spark, Hive",
        "scale": "Comparing between nearly 3 Billion and 200 Million Rows in 30 minutes"
      },
      {
        "title": "Spark Submit Orchestrator",
        "descriptions": ["Developed an orchestrator for Spark submissions and PySpark scripts, dynamically fetching configuration from MySQL. This centralizes and tracks job configurations, while providing data for performance monitoring."],
        "languages": "Stack:- Bash, SQL"
      },
      {
        "title": "StopLoss System",
        "descriptions": [
          "Shifted Spark Streaming to Structured Streaming, leading to a 50-pct reduction in latency and improved error handling, which also added exactly-once assurance that terminated the data audit pipeline.",
          "Implemented A/B testing to gain insights into traffic patterns and loss thresholds for individual entities. This initiative led to a remarkable reduction (15-pct) in overall losses, significantly contributing to the company’s research and development efforts and generating tangible improvements in profitability."
         ],
        "languages": "Stack:- Java, Structured Streaming, Batch Processing",
        "scale": "Fetching 50k records per second from Kafka and processing it in 5 minute bucket"
      }
    ]
  },
  {
    "company": "DEVSNEST",
    "company_location": "Remote, India",
    "role": "Backend Engineer",
    "time_duration": "October 2020 - October 2021",
    "stack": "Stack:- Ruby on Rails, Python, Redis, Amazon SQS",
    "details": [
      {
        "title": "Discord Automation and Notification System",
        "descriptions": [
            "Pioneered automation for group moderation on Discord through website, unlocking the peer-learning aspect of the product. Resulted in reduced management costs with increased community engagement.",
            "Developed an orchestrator for Spark submissions and PySpark scripts, dynamically fetching configurations from MySQL. This centralizes and tracks job configurations while providing data for performance monitoring."
            ],
        "languages": "Stack:- Ruby on Rails, Python, Amazon SQS",
        "scale": "Sending 2k messages per day. Reaching 10k Users in 3 months"
      }
    ]
  }
]